armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F7xx/Keil.STM32F7xx_DFP.pdsc
        <!-- *************************  Device 'STM32F745ZG'  ***************************** -->
        <device Dname="STM32F745ZG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F745ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745ZE'  ***************************** -->
        <device Dname="STM32F745ZE">
          <memory id="IROM1"                                    start="0x08000000" size="0x80000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x80000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x80000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x80000" default="1" />

          <variant Dvariant="STM32F745ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745VG'  ***************************** -->
        <device Dname="STM32F745VG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F745VGHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F745VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745VE'  ***************************** -->
        <device Dname="STM32F745VE">
          <memory id="IROM1"                                    start="0x08000000" size="0x80000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x80000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x80000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x80000" default="1" />

          <variant Dvariant="STM32F745VEHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F745VETx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745IG'  ***************************** -->
        <device Dname="STM32F745IG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F745IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F745IGKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F745IE'  ***************************** -->
        <device Dname="STM32F745IE">
          <memory id="IROM1"                                    start="0x08000000" size="0x80000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x80000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x80000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x80000" default="1" />

          <variant Dvariant="STM32F745IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F745IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F746'  **************************** -->
      <subFamily DsubFamily="STM32F746">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x6_v1r1.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F746xx"/>

        <debugvars configfile="CMSIS/Debug/STM32F74x_75x.dbgconf" version="2.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1" start="0x20010000" size="0x40000" init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x10000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F74x_75x_OPT.FLM" start="0x1FFF0000" size="0x0008" default="0"/>
        <algorithm name="CMSIS/Flash/STM32F7xx_OTP.FLM"     start="0x1FF0F000" size="0x0410" default="0"/>

        <book name="Documentation/DM00124865.pdf" title="STM32F74xx/5xx Reference Manual"/>
        <book name="Documentation/DM00166116.pdf" title="STM32F745/746 Data Sheet"/>

        <!-- *************************  Device 'STM32F746ZG'  ***************************** -->
        <device Dname="STM32F746ZG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F746ZGYx"> <feature type="CSP" n="143"/> </variant>
          <variant Dvariant="STM32F746ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746VG'  ***************************** -->
        <device Dname="STM32F746VG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F746VGHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F746VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746IG'  ***************************** -->
        <device Dname="STM32F746IG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F746IGKx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F746IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
