armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F7xx/Keil.STM32F7xx_DFP.pdsc
        <!-- *************************  Device 'STM32F756ZG'  ***************************** -->
        <device Dname="STM32F756ZG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F756ZGYx"> <feature type="CSP" n="143"/> </variant>
          <variant Dvariant="STM32F756ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756VG'  ***************************** -->
        <device Dname="STM32F756VG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F756VGHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F756VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756IG'  ***************************** -->
        <device Dname="STM32F756IG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F756IGKx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F756IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756BG'  ***************************** -->
        <device Dname="STM32F756BG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F756BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756NG'  ***************************** -->
        <device Dname="STM32F756NG">
          <memory id="IROM1"                                    start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                    start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"    start="0x00200000" size="0x100000" default="1" />

          <variant Dvariant="STM32F756NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F765'  **************************** -->
      <subFamily DsubFamily="STM32F765">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x5_v1r1.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F765xx"/>

        <debugvars configfile="CMSIS/Debug/STM32F76x_77x.dbgconf" version="2.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1" start="0x20020000" size="0x60000" init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F76x_77x_OPT.FLM" start="0x1FFF0000" size="0x0008" default="0"/>
        <algorithm name="CMSIS/Flash/STM32F7xx_OTP.FLM"     start="0x1FF0F000" size="0x0410" default="0"/>

        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00273119.pdf" title="STM32F765/767/768A/769 Data Sheet"/>

        <!-- *************************  Device 'STM32F765BG'  ***************************** -->
        <device Dname="STM32F765BG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F765BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765BI'  ***************************** -->
        <device Dname="STM32F765BI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F765BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765IG'  ***************************** -->
        <device Dname="STM32F765IG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F765IGKx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F765IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765II'  ***************************** -->
        <device Dname="STM32F765II">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F765IIKx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F765IITx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765NG'  ***************************** -->
        <device Dname="STM32F765NG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F765NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765NI'  ***************************** -->
        <device Dname="STM32F765NI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

