armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F7xx/Keil.STM32F7xx_DFP.pdsc
          <variant Dvariant="STM32F765NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765VG'  ***************************** -->
        <device Dname="STM32F765VG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F765VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765VI'  ***************************** -->
        <device Dname="STM32F765VI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F765VITx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765ZG'  ***************************** -->
        <device Dname="STM32F765ZG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F765ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765ZI'  ***************************** -->
        <device Dname="STM32F765ZI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F765ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F767'  **************************** -->
      <subFamily DsubFamily="STM32F767">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x7_v1r2.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F767xx"/>

        <debugvars configfile="CMSIS/Debug/STM32F76x_77x.dbgconf" version="2.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1" start="0x20020000" size="0x60000" init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F76x_77x_OPT.FLM" start="0x1FFF0000" size="0x0008" default="0"/>
        <algorithm name="CMSIS/Flash/STM32F7xx_OTP.FLM"     start="0x1FF0F000" size="0x0410" default="0"/>

        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00273119.pdf" title="STM32F765/767/768A/769 Data Sheet"/>

        <!-- *************************  Device 'STM32F767BI'  ***************************** -->
        <device Dname="STM32F767BI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F767BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767BG'  ***************************** -->
        <device Dname="STM32F767BG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F767BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767NI'  ***************************** -->
        <device Dname="STM32F767NI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

