armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F7xx/Keil.STM32F7xx_DFP.pdsc
          <variant Dvariant="STM32F778AIYx"> <feature type="CSP" n="180"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F779'  **************************** -->
      <subFamily DsubFamily="STM32F779">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x9_v1r2.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F779xx"/>

        <debugvars configfile="CMSIS/Debug/STM32F76x_77x.dbgconf" version="2.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1" start="0x20020000" size="0x60000" init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F76x_77x_OPT.FLM" start="0x1FFF0000" size="0x0008" default="0"/>
        <algorithm name="CMSIS/Flash/STM32F7xx_OTP.FLM"     start="0x1FF0F000" size="0x0410" default="0"/>

        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00225424.pdf" title="STM32F777/778A/779 Data Sheet"/>

        <!-- *************************  Device 'STM32F779BI'  ***************************** -->
        <device Dname="STM32F779BI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F779BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F779NI'  ***************************** -->
        <device Dname="STM32F779NI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F779NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F779II'  ***************************** -->
        <device Dname="STM32F779II">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F779IITx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F779AI'  ***************************** -->
        <device Dname="STM32F779AI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F779AIYx"> <feature type="CSP" n="180"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F732'  **************************** -->
      <subFamily DsubFamily="STM32F732">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x2_v1r0.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F732xx"/>

        <debugvars configfile="CMSIS/Debug/STM32F72x_73x.dbgconf" version="2.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1" start="0x20010000" size="0x30000" init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x10000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F72x_73x_OPT.FLM" start="0x1FFF0000" size="0x000C" default="0"/>
        <algorithm name="CMSIS/Flash/STM32F7x2_OTP.FLM"     start="0x1FF07800" size="0x0210" default="0"/>

        <book name="Documentation/DM00305990.pdf" title="STM32F72xxx/3xxx Reference Manual"/>
        <book name="Documentation/DM00330507.pdf" title="STM32F732xx/3xx Data Sheet"/>

        <!-- *************************  Device 'STM32F732VE'  ***************************** -->
        <device Dname="STM32F732VE">
          <memory id="IROM1"                                 start="0x08000000" size="0x80000" default="1"  startup="1"/>
          <memory id="IROM2"                                 start="0x00200000" size="0x80000" default="0"  startup="0"/>
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x2TCM_512.FLM" start="0x00200000" size="0x80000" default="1" />

          <variant Dvariant="STM32F732VETx"> <feature type="QFP" n="100"/> </variant>
        </device>
