armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F7xx/Keil.STM32F7xx_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="Full-speed" Capiversion="2.1.0" Cversion="1.9.0" condition="STM32F7 CMSIS_Driver USB">
      <description>USB Host Full-Speed Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_FS_STM32F7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="High-speed" Capiversion="2.1.0" Cversion="1.12.0" condition="STM32F7 CMSIS_Driver USB">
      <description>USB Host High-Speed Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS_STM32F7xx.c"/>
      </files>
    </component>

    <!-- STM32F769I-Discovery Board -->
    <bundle Cbundle="STM32F769I-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32F769I-Discovery Kit</description>
      <doc>MDK/Boards/ST/STM32F769I_Discovery/Documentation/DM00276557.pdf</doc>
      <component Cgroup="Drivers" Csub="Basic I/O" condition="STM32F769I-Discovery BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio" condition="STM32F769I-Discovery BSP Audio">
        <description>Audio for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM" condition="STM32F769I-Discovery BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD" condition="STM32F769I-Discovery BSP LCD">
        <description>LCD for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/otm8009a/otm8009a.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI" condition="STM32F769I-Discovery BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD" condition="STM32F769I-Discovery BSP SD">
        <description>uSD for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM" condition="STM32F769I-Discovery BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_sdram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen" condition="STM32F769I-Discovery BSP TS">
        <description>Touch Screen for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I-Discovery/stm32f769i_discovery_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft6x06/ft6x06.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/LED_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/Buttons_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="STM32F769I-Discovery TS">
        <description>Touchscreen Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/Touch_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F769I-Discovery GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32F769I_Discovery/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/GLCD_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="RGB IF" condition="STM32F769I-Discovery LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/LCD_X.c"/>
          <file category="source" name="Drivers/BSP/Components/otm8009a/otm8009a.c"/>
          <file category="header" name="Drivers/BSP/Components/otm8009a/otm8009a.h"/>
        </files>
      </component>
