armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F7xx/Keil.STM32F7xx_DFP.pdsc
    <!-- STM32756G-EVAL -->
    <board vendor="STMicroelectronics" name="STM32756G-EVAL" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32756G-EVAL Evaluation Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_small.jpg" large="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1199/PF261640" title="STM32756G_EVAL Evaluation Board Web Page"/>
      <book category="manual"    name="Drivers/BSP/STM32756G_EVAL/STM32756G_EVAL_BSP_User_Manual.chm" title="BSP User Manual"/>
      <!--book category="setup"     name="MDK/Boards/ST/STM32756G_EVAL/Documentation/DM00092826.pdf" title="Getting Started"/-->
      <book category="setup"     name="MDK/Boards/ST/STM32756G_EVAL/Documentation/STM32F756G-EVAL_QSG.pdf"   title="STM32F756G-Eval Quick Start Guide"/>
      <book category="schematic" name="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_sch.zip"    title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32756G_EVAL/Documentation/DM00188617.pdf"            title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_bom.zip"    title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F756NGHx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F756"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F746"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="RAM"       n="1"              name="8M x 32-bit SDRAM"/>
      <feature type="RAM"       n="1"              name="1M x 16-bit SRAM"/>
      <feature type="ROM"       n="1"              name="8M x 16-bit Nor Flash"/>
      <feature type="USB"       n="1"              name="High-Speed USB with micro-AB Connector"/>
      <feature type="USB"       n="2"              name="Full-Speed USB with micro-AB Connector"/>
      <feature type="Joystick"  n="1"              name="5-position Joystick"/>
      <feature type="Camera"    n="1"/>
      <feature type="Button"    n="4"              name="Push-Buttons for Reset, Wakeup, Tamper and User"/>
      <feature type="LED"       n="4"              name="4 color LEDs directly connected to port pins"/>
      <feature type="GLCD"      n="1"  m="640.480" name="5.7 inch Color TFT color LCD with capacitive touch panel"/>
      <feature type="Poti"      n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"    n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"   n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="MIC"       n="2"                name="ST MEMS microphones"/>
      <feature type="Speaker"   n="2"/>
      <feature type="Other"     n="1"              name="Digital Steroe Microphone"/>
      <feature type="CAN"       n="1"/>
      <feature type="RS232"     n="1"/>
      <feature type="ETH"       n="1"              name="10/100 Ethernet Port"/>
      <feature type="XTAL"      n="32000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="DIO"       n="34"             name="Motor Control Connector"/>
      <feature type="DIO"       n="56"             name="Daughterboard Extension header 1"/>
      <feature type="DIO"       n="60"             name="Daughterboard Extension header 2"/>
      <feature type="ConnOther" n="1"              name="Motor control connector"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- STM32F769I-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>


    <example name="CMSIS-RTOS Blinky with STM32CubeMX" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/CubeMX/Blinky">
      <description>CMSIS-RTOS based Blinky example configured with STM32CubeMX</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="emWin Example" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/emWin/Example">
      <description>emWin Graphics simple example</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>
    <example name="emWin GUI Demo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>
    <example name="USB Device HID" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/USB/Device/HID">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>
    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/USB/Device/MassStorage">
      <description>USB Mass Storage Device using RAM as storage media</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/USB/Device/VirtualCOM">
      <description>Bridge between PC USB Virtual COM Port and UART port</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="CDC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Virtual COM</keyword>
      </attributes>
    </example>
    <example name="USB Device WinUSB Echo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/USB/Device/WinUSB_Echo">
      <description>WinUSB Class Device echoing bulk endpoint data (implemented as Custom Class)</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="WinUSB_Echo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="Custom Class"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>WinUSB_Echo</keyword>
      </attributes>
    </example>
    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/USB/Host/MassStorage">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format the storage device</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Mass Storage</keyword>
      </attributes>
    </example>
    <example name="USB Host Keyboard" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/USB/Host/Keyboard">
      <description>Measure example using USB HID Keyboard as input device</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Keyboard.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>
    <example name="File System Demo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/FileSystem/File_Demo">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card, NOR/NAND Flash, RAM) and format each drive</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>
    <example name="BSD Client IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/BSD_Client">
      <description>Example using BSD sockets to send commands to remote server</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="BSD_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>
    <example name="BSD Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/BSD_Server">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>
    <example name="FTP Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/FTP_Server">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>
    <example name="HTTP Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/HTTP_Server">
      <description>Compact Web Server with CGI interface</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>
    <example name="HTTP Upload IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/HTTP_Upload">
      <description>Web Server with CGI interface and SD/MMC Memory Card as storage media</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="HTTP_Upload.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>
    <example name="SMTP Client IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/SMTP_Client">
      <description>Example showing how to compose and send emails</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>
    <example name="SNMP Agent IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/SNMP_Agent" version="1.0.1">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>
    <example name="Telnet Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F769I_Discovery/Middleware/Network/Telnet_Server">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="STM32F769I-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>

